cfd/OpenFOAM/compressible/HiSA/02_Force_Coefs/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "include/boundaryConditions"

// ************************************************************************* //

dimensions [0 1 -1 0 0 0 0];

internalField   uniform ($flowVelocity 0 0);


boundaryField
{
    "(inlet|outlet|freestream)"
    {
        type        characteristicFarfieldVelocity;
        U           ($flowVelocity 0 0);
        p           $pressure;
        T           $temperature;
        value       $internalField;
    }
    
    model
    {
        type        boundaryCorrectedFixedValue;
        value       uniform (0 0 0);
    }
    
    "proc.*"
    {
        type        processor;
    }
}

// ************************************************************************* //
