cfd/OpenFOAM/compressible/HiSA/02_Force_Coefs/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "include/boundaryConditions"

dimensions [0 0 0 1 0 0 0];

internalField uniform $temperature;

boundaryField
{
    "(inlet|outlet|freestream)"
    {
        type        characteristicFarfieldTemperature;
        U           ($flowVelocity 0 0);
        p           $pressure;
        T           $temperature;
        value       $internalField;
    }
    
    model
    {
        type        characteristicWallTemperature;
        value       $internalField;
    }
    
    "proc.*"
    {
        type        processor;
    }
}


// ************************************************************************* //
