cfd/OpenFOAM/compressible/HiSA/02_Force_Coefs/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "include/boundaryConditions"

// ************************************************************************* //

dimensions [0 0 -1 0 0 0 0];

internalField uniform $turbulentOmega;


boundaryField
{
    "(inlet|outlet|freestream)"
    {
        type            turbulentMixingLengthFrequencyInlet;
        mixingLength    1.0e-5;
        value           $internalField;
    }

    model
    {
        type            omegaWallFunction;
        value           uniform 1e8;
    }
    
    "proc.*"
    {
        type            processor;
    }
}

// ************************************************************************* //
