cfd/OpenFOAM/compressible/HiSA/02_Force_Coefs/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "include/convergenceConditions"
#include "include/relaxationFactors"

// ************************************************************************* //

solvers
{
    "(k|omega|nuTilda)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-10;
        relTol          0.1;
        minIter         1;
    }

    yPsi
    {
        solver          GAMG;
        smoother        GaussSeidel;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
        tolerance       1e-6;
        relTol          0;
    }
}


relaxationFactors
{
    fields
    {
        p               $relaxationFactors_p;
    }
    
    equations
    {
        U               $relaxationFactors_U;
        k               $relaxationFactors_k;
        omega           $relaxationFactors_omega;
        epsilon         $relaxationFactors_epsilon;
    }
}


flowSolver
{
    solver            GMRES;
    GMRES
    {
        inviscidJacobian  LaxFriedrichs;
        viscousJacobian   laplacian;
        preconditioner    LUSGS;

        maxIter           20;
        nKrylov           8;
        solverTolRel      1e-1 (1e-1 1e-1 1e-1) 1e-1;
    }
}


pseudoTime
{
    pseudoTol          1e-6 (1e-6 1e-6 1e-6) 1e-6;
    pseudoCoNum        1;
    pseudoCoNumMax     20.0;

    pseudoCoNumMaxIncreaseFactor  1.25;
    pseudoCoNumMin                0.1;

    localTimestepping             true;
    localTimesteppingBounding     true;
    localTimesteppingLowerBound   0.95;
}

// ************************************************************************* //
