cfd/OpenFOAM/compressible/HiSA/02_Force_Coefs/system/include/forceCoeffs
#include "$FOAM_CASE/0.orig/include/boundaryConditions"
#include "referenceData"

// ************************************************************************* //

//#includeEtc "caseDicts/postProcessing/forces/forceCoeffs.cfg"




forceCoeffs
{
    type            forceCoeffs;

    libs            ("libforces.so");

    writeControl    timeStep;
    timeInterval    1;

    log             yes;

    patches         (model);
    //rho             rho;
    rho             rhoInf;
    rhoInf          1.0;
    liftDir         (0 0 1);
    sideDir         (0 1 0);
    dragDir         (1 0 0);
    rollAxis        (1 0 0);
    pitchAxis       (0 1 0);
    yawAxis         (0 0 1);
    magUInf         $flowVelocity;
    lRef            $referenceLength;
    Aref            $referenceArea;
    CofR            (0 0 0);
}

// ************************************************************************* //
