cfd/OpenFOAM/compressible/HiSA/02_Force_Coefs/system/include/referenceData
// reference data for force coefficient computations
referenceLength     0.2674;
referenceArea       0.0929;
